snippets/organize-file.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-02-03 Sat 17:58 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Organize File</title>
<meta name="generator" content="Org mode">
</head>
<body>
<div id="preamble" class="status">
<link rel="stylesheet" type="text/css" href="/stylesheet.css"/>

<p align="right">
<a class="active" href="/"></a> |
<a href="/posts/">Posts</a> |
<a href="/snippets/">Snippets</a> |
<a href="/repository.html">Repository</a> |
<a href="/about.html">About</a> |
<a href="/rss.xml"> rss </a>
</p>
</div>
<div id="content">
<header>
<h1 class="title">Organize File</h1>
</header>
<div id="outline-container-org6266bc4" class="outline-2">
<h2 id="org6266bc4">Organize File&#xa0;&#xa0;&#xa0;<span class="tag"><span class="snippets">snippets</span>&#xa0;<span class="orgmode">orgmode</span></span></h2>
<div class="outline-text-2" id="text-org6266bc4">
<p>
From past few days I have been dabbling in the dimension of how to organize files, notes in effective manner. After jumping deep into the rabbit hole, I went on a spree of digesting several blog posts, articles on maintaining files, organizing notes, getting things done, what not, the list goes on.
</p>

<p>
With power of <b>org-mode</b> comes the doubt, is it efficient to maintain one big org file or multiple small files. Yes, its personal preference based on users need, there is no set guided rules.
</p>

<p>
I stumbled across <code>Zettelkasten</code> system which wasn&rsquo;t new, I was aware of it in the likes of <code>org-roam</code>, although I believe I did not have much matter to use it to some potential to form sensible network. So for now, no hard plans of multiple small files.
</p>

<p>
After many reading, especially Karl voit&rsquo;s posts (<a href="https://karl-voit.at">site</a>), I was kinda convinced that file system hierarchy does not make sense, as the file system model I have may change over time, and I would not like to remember and know where I placed something and where to place something. The schema of Zettelkasten is also against this, like you maintain small files and just connect them based on UniqueID or with complexity of SQL database. The simpler alternative would be <code>denote</code> emacs package, then too I don&rsquo;t see the light on using it to the potential. I liked denote way of naming files, and it is format agnostic, does not depend on anything. Just pure elisp to do the job.
</p>

<p>
Thus as a safer approach, I renamed some notes files to denote convention (as there is no harm/changes in that).
</p>

<p>
Ultimately the fruit to yield is, just go with whatever is easy and that gets the work done. Forgetting people&rsquo;s upfront images, looking at other side proved me that nobody is well organized in every way. Everybody lacks something in one or the other way, like I saw person who maintained file system well organized, but the desk and the room was gross and jam packed. So it depends, but the key takeaway is, if it just works; That&rsquo;s enough. But as time goes, changes and upgrades are required.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<br><br>
<!-- <p class="date" id="content" align="left" style="font-size:0.8em;">Posted on: 2023-12-16 Sat 00:00 -->
<!--   <br> -->
<!--  Updated on: 2024-02-03 Sat 17:58 -->
<!-- </p> -->

<p align="center" style="font-size:0.7em;">
<br>
- - - - - - -  - - - - - - -  - - - - - - -  - - - - - - -
<br><br>
 2023 - 2024 <b>Dilip</b>  Made with 󰣐  using <a href="https://orgmode.org/">Org-mode</a> &amp; <a href="https://www.gnu.org/software/emacs/">Emacs</a>
<br>
The <a href="https://github.com/idlip/idlip.github.io">code</a> for this site is licensed under the <a href="https://www.gnu.org/licenses/gpl-3.0.en.html">GPLv3</a>, and the content is licensed under <a href="https://creativecommons.org/licenses/by-sa/4.0/">CC-BY-SA 4.0</a>
</p>

<!-- with org convert -->

<!-- #+attr_html: :align center :style font-size:0.7em; -->
<!-- Made with 󰣐  using [[https://orgmode.org][Org-mode]] & [[https://www.gnu.org/software/emacs/][Emacs]] -->
<!-- The [[https://github.com/idlip/idlip.github.io][code]] for this site is licensed under the [[https://www.gnu.org/licenses/gpl-3.0.en.html][GPLv3]], and the content is licensed under [[https://creativecommons.org/licenses/by-sa/4.0/][CC-BY-SA 4.0]] -->
</div>
</body>
</html>
